// backend/src/server.js
const express = require("express");
const cors = require("cors");

const app = express();
const PORT = process.env.PORT || 3000;

app.use(cors());
app.use(express.json());


let recipientName = "พี่ดาว";
let senderName = "ขุมทรัพย์";
let letterMessage = "อันดับแรกผมอยากขอบคุณพี่ดาวจากใจจริงเลยครับ ตั้งแต่เรื่องที่ช่วยส่งเงินให้ทั้งรายวันและรายเดือน ผมรับรู้และซาบซึ้งมากจริงๆ ครับ จริงๆ แล้วผมไม่อยากรบกวนเลย แต่ก็ต้องยอมรับว่าค่าใช้จ่ายในแต่ละวันของผมค่อนข้างเยอะ ผมเองก็พยายามประคองและปรับตัวให้ใช้จ่ายอย่างดีที่สุดในทุกวัน และถ้าไม่มีพี่ดาวคอยช่วยเหลือ ผมคงลำบากมากกว่านี้จริงๆครับ ผมอยากบอกพี่ดาวไว้ตรงนี้เลยว่า เมื่อไหร่ที่ผมสามารถหางานได้ มีงานมั่นคง มีรายได้ของตัวเอง ผมจะกลับมาตอบแทนความช่วยเหลือทั้งหมดที่พี่มีให้ผมอย่างแน่นอนครับ ผมสัญญาเลยครับ ในวันเกิดปีนี้ ขุมทรัพย์ขอให้พี่ดาวมีความสุขมากๆ ในทุกๆวัน ขอให้สมหวังในทุกสิ่งที่ตั้งใจไว้ ขอให้มีสุขภาพที่แข็งแรง ยิ้มได้อย่างสดใสในทุกวัน และขอให้ฐานะการเงินมั่นคง เจริญรุ่งเรืองขึ้นเรื่อยๆนะครับ 💛✨"


app.get("/api/letter", (req, res) => {
  res.json({
    recipientName,
    senderName,
    letterMessage
  });
});

app.post("/api/letter", (req, res) => {
  const {
    recipientName: newRecipientName,
    senderName: newSenderName,
    letterMessage: newLetterMessage
  } = req.body;

  if (newRecipientName) recipientName = newRecipientName;
  if (newSenderName) senderName = newSenderName;
  if (newLetterMessage) letterMessage = newLetterMessage;

  return res.status(200).json({
    message: "Letter updated",
    recipientName,
    senderName,
    letterMessage
  });
});

app.get("/api/wishes", (req, res) => {
  res.json({
    recipientName,
    senderName,
    letterMessage
  });
});

app.listen(PORT, () => {
  console.log(`Backend listening on http://localhost:${PORT}`);
});
